import styles from './Refund.module.css';

export const Refund = () => {
  return (
    <div className={styles.wrapper}>
      <h1>Обмін та повернення</h1>
      <p>
        При здійсненні своєї діяльності ми керуємося виключно
        законодавством. Ви маєте право обміняти товар належної
        якості упродовж 14 днів, не рахуючи дня купівлі. Обміну
        підлягає товар належної якості, якщо він не
        використовувався за призначенням і збережено його
        товарний вигляд (не порушена плівка на упаковці).
      </p>
      <h4>Ви бажаєте повернути товар куплений в нашому магазині?</h4>
      <p>
        Ми розглядаємо запит покупця щодо обміну товару і
        впродовж 5 днів здійснюємо обмін товару або даємо
        вмотивовану відмову, у випадку, якщо обмін неможливий. Товар, що став
        непридатним в результаті його
        некоректного використання обміну і поверненню  не підлягає. 
      </p>
    </div>
  );
};
