import styles from './DiscountProgramme.module.css';

export const DiscountProgramme = () => {
  return (
    <div className={styles.wrapper}>
      <h1>Дисконтна програма</h1>
      <h2>НАКОПИЧУВАЛЬНА СИСТЕМА ЗНИЖОК</h2>
      <p>
        У нашому магазині ви знайдете широкий асортимент настільних ігор,
        новинки та мінімальні роздрібні ціни, що встановлюють виробники.
      </p>
      <p>
        Окрім того, для <b>наших постійних клієнтів</b> є приємна та досить
        нескладна <b>накопичувальна система знижок*</b>. Вона виглядає наступним
        чином:
      </p>

      <ul>
        <li>
          2% як тільки сума ваших замовлень на сайті становитиме 3 000 грн.
        </li>
        <li>
          4% як тільки сума ваших замовлень на сайті становитиме 6 000 грн.
        </li>
        <li>
          6% як тільки сума ваших замовлень на сайті становитиме 10 000 грн.
        </li>
        <li>
          8% як тільки сума ваших замовлень на сайті становитиме 15 000 грн.
        </li>
        <li>
          10% як тільки сума ваших замовлень на сайті становитиме 20 000 грн.
        </li>
      </ul>
      <h4>
        Розмір знижки присвоюється вашому обліковому запису автоматично,
        збільшення розміру знижки відбувається і відображається одразу по
        досягненню вами відповідної межі.
      </h4>
      <p>
        <b>
          Для батьківських комітетів, шкіл, дитячих садочків, гуртків,
          кав’ярень, коворкінгів і т.п.
        </b>
         існують окремі пропозиції щодо співпраці та знижок. Кожне таке
        замовлення детально обговорюється, надаються усі необхідні консультації
        та прорахунки індивідуально під кожен запит, щоб максимально
        задовольнити потреби клієнта. Задля отримання більш детальної інформації
        обов’язково вкажіть це у коментарях до замовлення, або ж зв’яжіться з
        нами у будь-який зручний для вас спосіб:
      </p>
      <ul>
        <li>
          за телефонами <a href='tel:(093)-164-20-16'>(093) 1642016</a>,
          <a href='tel:(096)-551-16-38'>(096) 5511638</a>;
        </li>
        <li>Viber, WhatsApp, Telegram;</li>
        <li>e-mail: </li>
      </ul>
      <p>
        * Знижки, що діють на один і той самий товар, не сумуються. У такому
        випадку для вас автоматично буде відображатися ціна з максимальною
        знижкою серед доступних для Вас.
      </p>
    </div>
  );
};
